w4kpm/stm32f429-discovery-chibios-pppos/main.c
	    }
	    
}





void read_fb_rect(void)
{
    uint16_t xpos,ypos,height,width;
    uint32_t encoding;
    char text[255];
    xpos = read_16();
    ypos = read_16();
    height = read_16();
    width = read_16();
    encoding = read_32();
    //sprintf(text,"New Rect %d %d %d %d %d\r\n",xpos,ypos,height,width,encoding);
    //log_data(text);
    switch (encoding)
	{
	case 0: 
	    read_raw_rect(xpos,ypos,height,width);
	    break;
	case 1:
	    read_copy_rect(xpos,ypos,height,width);
	    break;
        case 5:
	    read_hextile_rect(xpos,ypos,height,width);
	    break;
	default:
	    log_data_num("Got unexpected encoding %d\r\n",encoding);
	}

	    
	
}



void process_frame_response()
{
    uint8_t message,padding;
    int x;
    uint16_t numrects;
    message = read_8();
    if (message == 0)
	{
	    padding = read_8();
	    numrects = read_16();
	    //log_data_num("number of high level rects %d\r\n",numrects);
	    for (x=0;x<numrects;x++)
		{
		    //	    log_data_num("high level rect # %d\r\n",x);
		    read_fb_rect();
		    //chThdSleepMilliseconds(10);
		}
	}
    else
	{
	    log_data_num("Unexpected message (%d) -- (I was expecting frame response, but got something else):\r\n",message);
	}
    
    //    read_all_data("Doing process_frame_response");
    //lwip_close(vncsocket);
}

void read_pixel_format_data(void)
{
    uint32_t strLength;
    log_data_num("width: %d\r\n",read_16()); 
    log_data_num("height: %d\r\n",read_16()); 
    log_data_num("bpp: %d\r\n",read_8()); 
    log_data_num("depth: %d\r\n",read_8()); 
    log_data_num("big-endian: %d\r\n",read_8()); 
    log_data_num("true-color: %d\r\n",read_8()); 
    log_data_num("red-max: %d\r\n",read_16()); 
    log_data_num("green-max: %d\r\n",read_16()); 
    log_data_num("blue-max: %d\r\n",read_16()); 
    log_data_num("red-shift: %d\r\n",read_8()); 
    log_data_num("green-shift: %d\r\n",read_8()); 
    log_data_num("blue-shift: %d\r\n",read_8());
    lwip_recv(vncsocket,&vncbuffer,3,0); // per the protocol, there is 
                                         // three bytes of padding
    strLength= read_32();
    ensure_bytes(strLength);
    vncbuffer[strLength] = 0;
    log_data("name:\r\n     ");
    log_data(vncbuffer);
    log_data("\r\n");

}




void framebuffer_request(uint16_t x, 
			 uint16_t y, 
			 uint16_t width, 
			 uint16_t height, 
			 uint8_t incremental)
{
    int len;
    uint16_t *midptr;
    uint32_t *longptr;

    //    read_all_data("Begin FB Request");
    vncbuffer[0] = 3; // message type
    vncbuffer[1] = incremental;
    set_16(vncbuffer+2,x);
    set_16(vncbuffer+4,y);
    set_16(vncbuffer+6,width);
    set_16(vncbuffer+8,height);

    len = lwip_send(vncsocket,&vncbuffer,10,0);
    if (len != 10)
	log_data("set Encodings Incorrect length\r\n");
    process_frame_response();
}



void set_encodings()
{
    int x;
    
    vncbuffer[0] = 2; // message
    vncbuffer[1] = 0; // padding
    set_16(vncbuffer+2,3); // we're using 3 encodings
    set_32(vncbuffer+4,5); // hextile
    set_32(vncbuffer+8,1); // copyrect
    set_32(vncbuffer+12,0); // raw

    // - only to print out raw bytes and make sure things were 
    // in correct order.

    //chprintf((BaseSequentialStream*)&SD4,"Encoding:\r\n    ");
    //for (x=0;x<16;x++)
    //	chprintf((BaseSequentialStream*)&SD4,"0x%X ",vncbuffer[x]);
    //chprintf((BaseSequentialStream*)&SD4,"\r\n");
    x = lwip_send(vncsocket,&vncbuffer,16,0);
    if (x != 16)
	log_data("set Encodings Incorrect length\r\n");
	

}

int connect_vnc(void){
    write_string("RFB 003.003\n");

    write_byte(1); // Share flag - we allow sharing

    set_encodings();
    read_all_data("Server Response");
    read_all_data("Security Code");
    read_pixel_format_data();    
}





static THD_WORKING_AREA(waVncThread, 2048 );
static THD_FUNCTION(VncThread, arg) {

	int ret;
	int pass;
	int x;
	struct sockaddr_in sa;

	int recsize;
	socklen_t cli_addr_len;
	struct sockaddr_in cli_addr;

	socklen_t fromlen;

	chRegSetThreadName("EchoServerThread");
	chprintf((BaseSequentialStream*)&SD4,"Shell Server Starting \r\n");

	vncsocket = lwip_socket(AF_INET,  SOCK_STREAM, IPPROTO_TCP);
	if (vncsocket == -1) {
	    chprintf((BaseSequentialStream*)&SD4,"Closing A - no socket \r\n");

		return MSG_RESET;
	}

	memset(&sa, 0, sizeof(sa));
	sa.sin_family = AF_INET;
	sa.sin_port = PP_HTONS(SOCK_TARGET_PORT);
	sa.sin_addr.s_addr = inet_addr(SOCK_TARGET_HOST);
	fromlen = sizeof(sa);
	ret = lwip_connect(vncsocket, (struct sockaddr*)&sa, sizeof(sa));
	chprintf((BaseSequentialStream*)&SD4,"Returned '%d' \r\n",ret);
	connect_vnc();
	//chThdSleepMilliseconds(5000);
	framebuffer_request(0,0,800,480,0);
	while (TRUE)
	    {
		log_data("****************************************\r\n");
		//read_all_data("getting ready to read");
		chprintf((BaseSequentialStream*)&SD4,".");
		//chThdSleepMilliseconds(10);
		framebuffer_request(0,0,800,480,1);
		pass ++;
		if (pass%2 ==0)
		    {
			palClearPad(GPIOG, 14);
		    }
		else
		    {
			palSetPad(GPIOG, 14);
		    }

	    }
	
}


static THD_WORKING_AREA(waEchoServerThread, 2048 );
static THD_FUNCTION(EchoServerThread, arg) {
	(void) arg;
	int pass = 0;
  
	int sock,newsockfd;
	struct sockaddr_in sa;
	char buffer[1024];
	int recsize;
	socklen_t cli_addr_len;
	struct sockaddr_in cli_addr;

	socklen_t fromlen;

	chRegSetThreadName("EchoServerThread");
	chprintf((BaseSequentialStream*)&SD4,"Shell Server Starting \r\n");

	sock = lwip_socket(AF_INET,  SOCK_STREAM, IPPROTO_TCP);
	if (sock == -1) {
	    chprintf((BaseSequentialStream*)&SD4,"Closing A - no socket \r\n");

		return MSG_RESET;
	}

	memset(&sa, 0, sizeof(sa));
	sa.sin_family = AF_INET;
	sa.sin_addr.s_addr = htonl(INADDR_ANY);
	sa.sin_port = PP_HTONS(26);
	fromlen = sizeof(sa);

	if (lwip_bind(sock, (struct sockaddr *) &sa, sizeof(sa)) == -1) {
	    chprintf((BaseSequentialStream*)&SD4,"Closing B - no BIND \r\n");
		lwip_close(sock);
		return MSG_RESET;
	}
	if (lwip_listen(sock, 1) < 0) {
		lwip_close(sock);
		return MSG_RESET;
	}

